fruits = ["apple", "banana", "papaya", "strawberry", "coconut", "blueberry"]

# Задача 1
# Вывести элементы списка fruits в пронумерованном виде, по следующей схеме:
# 1: apple
# 2: banana

# Задача 2
newlist = [] # Пустой список
# Сделать второй список (с 2-3 фруктами)
# Создать третий список, где скомбинировать содержимое 
# двух списков, затем отсортировать его (см. материал)

# Задача 3
# Получить от пользователя индекс элемента в списке,
# затем вывести соответствующий элемент

# Задача 4
# Записать содержимое списка в файл fruits.txt

# Задача 5
# Прочитать данные из файла, составить на их основе список,
# вывести элементы в командную строку в обратном порядке
